system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;
maxH 1.852;
diam_gas 0.002;
D 0.044;
h 1.050;
H 0.800;
deslc 0.001;

vertices
(
    (0         0         0)         //v0'
    (0         $D        0)         //v1
    (0         $D        $h )       //v2
    (0         $D         1.052)    //v3
    (0         $D         $maxH)    //v4
    (0         0          $maxH)    //v5
    (0         0          1.052)    //v6
    (0         0          $h)       //v7

    (0.001     0          0)        //v0'
    (0.001     $D         0)        //v1
    (0.001     $D        $h )       //v2
    (0.001     $D        1.052)     //v3
    (0.001     $D        $maxH)     //v4
    (0.001     0         $maxH)     //v5
    (0.001     0         1.052)     //v6
    (0.001     0         $h)        //v7
);

blocks
(
    hex (0 1 2 7 8 9 10 15) (1 10 10) simpleGrading (1 1 1)
    hex (7 2 3 6 15 10 11 14) (1 10 10) simpleGrading (1 1 1)
    hex (6 3 4 5 14 11 12 13) (1 10 10) simpleGrading (1 1 1)
);

boundary
(
    w_inlet
    {
        type patch;
        faces
        (
            (0 8 9 1)
        );
    }
    g_inlet
    {
        type patch;
        faces
        (
            (2 10 11 3)
        );
    }
    mix_outlet
    {
        type patch;
        faces
        (
            (4 12 13 5)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (0 1 2 7)
            (1 9 10 2)
            (9 10 15 8)
            (15 7 0 8)
            (3 11 12 4)
            (11 12 13 14)
            (13 5 6 14)
            (3 4 5 6 )
            (10 11 14 15)
            (6 7 15 14)
            (2 3 6 7)
        );
    }
    zPlan
    {
        type empty;
        faces
        (

        );
    }
);
// ************************************************************************* //
